app/controllers/comments_controller.rb

  def create
      @post = Post.find(params[:post_id])
      @comment =
@post.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "14"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "what a rookie"], ["commenter", "jim"], ["created_at", Thu, 07 Nov 2013 07:38:32 UTC +00:00], ["post_id", 14], ["updated_at", Thu, 07 Nov 2013 07:38:32 UTC +00:00]]