app/controllers/posts_controller.rb

  def update
      @post = Post.find(params[:id])

      if @post.update(params[:post].permit(:title, :text))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "hello"], ["text", "dfk"], ["updated_at", Tue, 05 Nov 2013 21:40:31 UTC +00:00]]

  def create
      @post = Post.new(params[:post].permit(:title, :text))

      if  @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 29 Oct 2013 03:06:25 UTC +00:00], ["text", "d"], ["title", "d"], ["updated_at", Tue, 29 Oct 2013 03:06:25 UTC +00:00]]

  def show
      @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 15]]